tutorials/cases/charOnlyMoveCases/serial_inet_tinyDt/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0      0      0   )
    (0.02   0      0   )
    (0.02   0.01   0   )
    (0      0.01   0   )
    (0      0      0.001)
    (0.02   0      0.001)
    (0.02   0.01   0.001)
    (0      0.01   0.001)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 10 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type wall;
        faces
        (
            (1 2 6 5)
        );
    }
    wall
    {
        type wall;
        faces
        (
            (2 3 7 6)
        );
    }
    axis
    {
        type wall;
        faces
        (
            (1 0 5 4)
        );
    }
    back
    {
        type empty;
        faces
        (
            (0 2 1 3)
        );
    }
    front
    {
        type empty;
        faces
        (
            (4 5 6 7)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
